<?php include_once "../../app/php/head.php"; ?>

<!-- PHP. Author: Daniil Dybka, daniil@dybka.ru -->
<title>Технологии | Аквариум</title>

<link rel="stylesheet" href="/app/css/pages/about.css" />

<body class="container">
    <?php include_once "../../app/php/header.php"; ?>
    <main class="col-md-8 mx-auto" style="margin-bottom: 50px" id="main">
        <h1 class="h3">Технологии</h1>
        <p>
            В проекте "Аквариум" используются различные технологии, предназначенные для обеспечения удобства использования, функциональности и повышения пользовательского опыта. Давайте рассмотрим, какие технологии используются, для чего они применяются, и какие изменения они повлекли за собой.
        </p>

        <h2 class="h4">Пользователю</h2>

        <h3 class="h5">Второй аккаунт для быстрого переключения</h3>
        <p>
            Добавление второго аккаунта обеспечивает пользователям возможность быстрого переключения между учетными записями.
        </p>
        <p>
            Удобство использования для пользователей, возможность управления несколькими профилями.
        </p>
        <p>
            Появление второго аккаунта способствует удобству и гибкости в использовании проекта для пользователей.
        </p>

        <h3 class="h5">Добавление постов</h3>
        <p>
            Возможность добавления постов обогащает контент проекта.
        </p>
        <p>
            Добавление постов повышает информативность и интерес к проекту.
        </p>

        <h3 class="h5">OAuth Яндекс и Google для быстрого входа</h3>
        <p>
            Использование протокола OAuth через Яндекс и Google обеспечивает быстрый и безопасный вход пользователей в систему.
        </p>
        <p>
            Упрощение процесса аутентификации, уменьшение времени и сложности входа.
        </p>
        <p>
            Реализация OAuth через Яндекс и Google обеспечивает более удобный и безопасный процесс аутентификации для пользователей.
        </p>

        <h2 class="h4">Исходный код</h2>

        <h3 class="h5">Laravel</h3>
        <p>
            Laravel, как современный и мощный фреймворк, обеспечивает разработку функционального и безопасного
            front-end и back-end для проекта. Он используется для построения надежной архитектуры и обработки веб-запросов.
        </p>
        <p>
            Laravel, как современный и мощный фреймворк, обеспечивает разработку функционального и безопасного front-end и back-end для проекта. Он используется для построения надежной архитектуры и обработки веб-запросов.
        </p>
        <p>
            Использование Laravel способствует повышению эффективности разработки и обеспечивает более высокую безопасность проекта.
        </p>

        <h3 class="h5">Телеграм бот для уведомлений и логирование в базу данных</h3>
        <p>
            Регистрация и отслеживание различных событий и действий пользователей для целей анализа и
            обеспечения безопасности проекта. Телеграм бот применяется для отправки уведомлений пользователям,
            обеспечивая своевременную информацию о важных событиях и изменениях в проекте.
        </p>
        <p>
            Обеспечение надежности и безопасности данных, возможность анализа действий пользователей и проблем в проекте.
            Улучшение коммуникации с пользователями, информирование о новостях и важных обновлениях.
        </p>
        <p>
            Логирование в базу данных позволяет проводить анализ действий пользователей и предотвращать проблемы безопасности.
            Использование Телеграм бота упрощает взаимодействие с проектом и обеспечивает более оперативное уведомление пользователей.
        </p>

        <h3 class="h5">Bootstrap</h3>
        <p>
            Использование Bootstrap обеспечивает разработку гибкого и адаптивного front-end.
        </p>
        <p>
            Улучшение пользовательского контента и визуального оформления проекта, обеспечение адаптивности для
            различных устройств.
        </p>
        <p>
            Улучшение пользовательского контента и визуального оформления проекта, обеспечение
            адаптивности для различных устройств.
        </p>

        <h3 class="h5">Fancybox, jQuery, WowJS</h3>
        <p>
            Использование Fancybox для отображения медиа-контента, jQuery для дополнительной функциональности и
            обработки событий, а также WowJS для анимаций на странице.
        </p>
        <p>
            Улучшение визуальных и интерактивных возможностей проекта, создание мультимедийного контента.
        </p>
        <p>
            Использование указанных технологий обогащает визуальный опыт пользователей и придает
            проекту современный и интерактивный вид.
        </p>

        <h3 class="h5">ReadBeanPHP</h3>

        <p>Использование библиотеки ReadBeanPHP для упрощения работы с подключением и запросов к базе данных.</p>

    </main>

    <script src="/app/js/pages/about-addlinkhead.js"></script>

    <?php include_once "../../app/php/bottom/footer-content.php"; ?>

    <?php include_once "../../app/php/bottom/javascript.php"; ?>
</body>

</html>
