<?php include_once "../../../app/php/head.php"; ?>

<!-- PHP. Author: Daniil Dybka, daniil@dybka.ru -->
<title>Условия использования | Аквариум</title>

<link rel="stylesheet" href="/app/css/pages/about.css" />

<body class="container">
    <?php include_once "../../../app/php/header.php"; ?>

    <main id="main">
        <h1>Условия использования</h1>
        <p>
            Настоящий документ «Пользовательское соглашение» представляет собой предложение
            «Аквариум» (далее — «Администрация»), заключить договор на изложенных ниже условиях
            Соглашения.
        </p>
        <h2>1. Общие положения Пользовательского соглашения</h2>
        <p>
            1.1. В настоящем документе и вытекающих или связанным с ним отношениях Сторон
            применяются следующие термины и определения:
        </p>
        <ul>
            <li>Платформа — программно-аппаратные средства, интегрированные с Сайтом
                Администрации;</li>
            <li>Пользователь — дееспособное физическое лицо, присоединившееся к настоящему
                Соглашению в собственном интересе либо выступающее от имени и в интересах
                представляемого им юридического лица;</li>
            <li>Сайт Администрации/ Сайт — интернет-сайты, размещенные в домене https://aquarium.org.ru и его
                поддоменах;</li>
            <li>Сервис — комплекс услуг и лицензия, предоставляемые Пользователю с использованием
                Платформы;</li>
            <li>Соглашение — настоящее соглашение со всеми дополнениями и изменениями.</li>
        </ul>

        <p>
            1.2. Использование вами Сервиса любым способом и в любой форме в пределах его
            объявленных функциональных возможностей, включая:
        </p>
        <ul>
            <li>просмотр размещенных на Сайте материалов;</li>
            <li>регистрация и/или авторизация на Сайте;</li>
            <li>- размещение или отображение на Сайте любых материалов, включая но не ограничиваясь
                такими как: тексты, гипертекстовые ссылки, изображения, аудио и видео- файлы,
                сведения и/или иная информация.</li>
        </ul>
        <p>
            Создает договор на условиях настоящего Соглашения в соответствии с положениями ст.437 и
            438 Гражданского кодекса Российской Федерации
        </p>
        <p>
            1.3. Воспользовавшись любой из указанных выше возможностей по использованию Сервиса вы
            подтверждаете, что:
        </p>
        <ul>
            <li>ознакомились с условиями настоящего Соглашения в полном объеме до начала
                использования Сервиса;</li>
            <li>принимаете все условия настоящего Соглашения в полном объеме без каких-либо изъятий и
                ограничений с вашей стороны и обязуетесь их соблюдать или прекратить использование
                Сервиса. Если вы не согласны с условиями настоящего Соглашения или не имеете права на
                заключение договора на их основе, вам следует незамедлительно прекратить любое
                использование Сервиса;</li>
            <li>соглашение (в том числе любая из его частей) может быть изменено Администрацией без
                какого-либо специального уведомления. Новая редакция Соглашения вступает в силу с момента
                ее размещения на Сайте Администрации либо доведения до сведения Пользователя в иной
                удобной форме, если иное не предусмотрено новой редакцией Соглашения.</li>
        </ul>

        <h2>2. Общие условия пользования Сервисом</h2>
        <p>
            2.1. Использование функциональных возможностей Сервиса допускается только после
            прохождения Пользователем регистрации и авторизации на Сайте в соответствии с
            установленной Администрацией процедурой.
        </p>
        <p>
            2.2. Технические, организационные и коммерческие условия использования Сервиса, в том
            числе его функциональных возможностей доводятся до сведения Пользователей путем
            отдельного размещения на Сайте или путем нотификации Пользователей.
        </p>
        <p>
            2.3. Выбранные Пользователем логин и пароль являются необходимой и достаточной
            информацией для доступа Пользователя на Сайт. Пользователь не имеет права передавать свои
            логин и пароль третьим лицам, несет полную ответственность за их сохранность,
            самостоятельно выбирая способ их хранения.
        </p>
    </main>

    <div class="about-up about-up-dontsee" id="about-up">
        <a href="#" aria-label="Перейти наверх">
            <svg>
                <use xlink:href="/app/img/icons/bootstrap.svg#chevron-up"></use>
            </svg>
        </a>
    </div>

    <script src="/app/js/about-addlinkhead.js"></script>

    <script src="/app/js/about-addupbutton.js"></script>

    <?php include_once "../../../app/php/bottom/footer-content.php"; ?>

    <?php include_once "../../../app/php/bottom/javascript.php"; ?>
</body>
