<?php include_once "../../../app/php/head.php"; ?>

<!-- PHP. Author: Daniil Dybka, daniil@dybka.ru -->
<title>Политика обработки файлов cookie | Аквариум</title>

<link rel="stylesheet" href="/app/css/pages/about.css" />

<body class="container">
    <?php include_once "../../../app/php/header.php"; ?>

    <main id="main">
        <h1>Политика обработки файлов cookie</h1>
        <p>
            Посещая сайт «Аквариум» в сети «Интернет», вы соглашаетесь с настоящей политикой, в том числе с тем, что «Аквариум»
            может
            использовать файлы cookie и иные данные для их последующей обработки системами Google Analytics, Яндекс.Метрика и
            др., а
            также может передавать их третьим лицам для проведения исследований, выполнения работ или оказания услуг.
        </p>

        <h2>Что такое файлы cookie</h2>
        <p>
            Файлы cookie – текстовые файлы небольшого размера, которые сохраняются на вашем устройстве (персональном компьютере,
            ноутбуке, планшете, мобильном телефоне и т.п.), когда вы посещаете сайты в сети «Интернет».
        </p>
        <p>
            Кроме того, при посещении сайта «Аквариум» в сети «Интернет» происходит автоматический сбор иных данных, в том
            числе:
            технических характеристик устройства, IP-адреса, информации об используемом браузере и языке, даты и времени доступа
            к
            сайту, адресов запрашиваемых страниц сайта и иной подобной информации.
        </p>
        <h2>Какие виды файлов cookie используются</h2>
        <p>
            В зависимости от используемых вами браузера и устройства используются разные наборы файлов cookie, включающие в себя
            строго необходимые, эксплуатационные, функциональные и аналитические файлы cookie.
        </p>
        <h2>Для чего могут использоваться файлы cookie</h2>
        <p>
            При посещении вами сайта «Аквариум» в сети «Интернет» файлы cookie могут использоваться для:
        </p>
        <ul>
            <li>обеспечения функционирования и безопасности сайта;</li>
            <li>улучшения качества сайта;</li>
            <li>регистрации в системе самообслуживания (личном кабинете);</li>
            <li>предоставлении вам информации о «Аквариуме», его продуктах и услугах;</li>
            <li>усовершенствования продуктов и (или) услуг и для разработки новых продуктов и (или) услуг.</li>
        </ul>
        <p>
            Иная собираемая информация может быть использована для генерации вашего «списка интересов», состоящего из случайного
            идентификатора, категории интереса и отметки времени для демонстрации вам интернет-контента и рекламных объявлений,
            соответствующих вашим интересам.
        </p>
        <h2>Как управлять файлами cookie</h2>
        <p>
            Используемые вами браузер и (или) устройство могут позволять вам блокировать, удалять или иным образом ограничивать
            использование файлов cookie. Но файлы cookie являются важной частью сайта «Аквариум» в сети «Интернет», поэтому
            блокировка, удаление или ограничение их использования может привести к тому, что вы будете иметь доступ не ко всем
            функциям сайта.
        </p>

        <p>
            Чтобы узнать, как управлять файлами cookie с помощью используемых вами браузера или устройства, вы можете
            воспользоваться инструкцией, предоставляемой разработчиком браузера или производителем устройства.
        </p>
    </main>

    <div class="about-up about-up-dontsee" id="about-up">
        <a href="#" aria-label="Перейти наверх">
            <svg>
                <use xlink:href="/app/img/icons/bootstrap.min.svg#chevron-up"></use>
            </svg>
        </a>
    </div>

    <script src="/app/js/pages/about-addlinkhead.js"></script>

    <script src="/app/js/pages/about-addupbutton.js"></script>

    <?php include_once "../../../app/php/bottom/footer-content.php"; ?>

    <?php include_once "../../../app/php/bottom/javascript.php"; ?>
</body>
