<?php include_once "../app/php/head.php"; ?>

<!-- PHP. Author: Daniil Dybka, daniil@dybka.ru -->
<title>Социальная сеть Аквариум</title>

<style>
    main h2 {
        margin-top: 30px;
    }
</style>

<body class="container">
    <?php include_once "../app/php/header.php"; ?>

    <div class="container px-0" style="margin-bottom: 50px">
        <div class="row row-cols-1 row-cols-lg-5 g-4">
            <div class="col">
                <div class="p-4 background-light h-100 rounded-3">
                    <h3 class="mb-1">🐠 Соцсеть</h3>
                    <p class="mb-0 fs-6">
                        Социальная сеть для всех. Первый клиент, авторизация в аккаунт, поиск
                        друзей и общения прямо сейчас.
                    </p>
                </div>
            </div>
            <div class="col">
                <div class="p-4 background-light h-100 rounded-3">
                    <h3 class="mb-1">👭 Друзья</h3>
                    <p class="mb-0 fs-6">
                        Найдите себе людей по вкусу: подпишитесь на человека, следите
                        за его новостями.
                    </p>
                </div>
            </div>
            <div class="col">
                <div class="p-4 background-light h-100 rounded-3">
                    <h3 class="mb-1">💫 Лента</h3>
                    <p class="mb-0 fs-6">
                        Ваша лента с новостями, без рекламы. Только полезные рекомендации.
                    </p>
                </div>
            </div>
            <div class="col">
                <div class="p-4 background-light h-100 rounded-3">
                    <h3 class="mb-1">🤖 Защита</h3>
                    <p class="mb-0 fs-6">
                        Шифрование пароля, защищенные запросы и полная конфиденциальность
                        данных.
                    </p>
                </div>
            </div>
            <div class="col">
                <div class="p-4 background-light h-100 rounded-3">
                    <h3 class="mb-1">❤️ Эмоции</h3>
                    <p class="mb-0 fs-6">
                        Сохраняйте Ваши приятные воспоминания, и вспоминайте их почаще.
                    </p>
                </div>
            </div>
        </div>
    </div>

    <main class="col-md-8 mx-auto" style="margin-bottom: 50px">
        <h1>Аквариум</h1>
        <p>
            Аквариум - социальная сеть, доступная для всех. Поиск друзей, единомышленников.
            Открывайте в браузере, скачивайте приложение. Вы всегда будете в сети.
        </p>

        <h2>Откуда возник проект</h2>
        <p>
            Проект «Аквариум» возник как потребность в удобной соцсети для публикации фотографий, историй
            из жизни. Без мошеннических схем, навязчивой рекламы и прочего.
        </p>

        <h2>В чем цель</h2>
        <p>
            Цель проекта «Аквариум» - подарить пользователю удобную платформу с понятным интерфейсом
            для публикации фотографий и историй из жизни.
        </p>

        <h2 id="verify-account">Верификация аккаунта</h2>
        <p>
            Написать тексты с помощью GPT-4.
        </p>
    </main>

    <?php include_once "../app/php/footer.php"; ?>
</body>

</html>
