<!-- PHP. Author: Daniil Dybka, daniil@dybka.ru -->

<?php include_once "../app/php/content/head.php"; ?>

<title>Социальная сеть Аквариум</title>

<body class="container">
    <?php include_once "../app/php/content/header.php"; ?>

    <main>
        <div class="row row-cols-2" style="margin-bottom: 30px">
            <div class="col p-4">
                <div class="p-4 bg-light rounded-3">
                    <h3 class="mb-3">🐠 Соцсеть Аквариум</h3>
                    <p class="mb-0 fs-6">
                        Социальная сеть для всех. Первый клиент, авторизация в аккаунт, поиск
                        друзей и общения прямо сейчас.
                    </p>
                </div>
            </div>
            <div class="col p-4">
                <div class="p-4 bg-light rounded-3">
                    <h3 class="mb-3">🤖 Защита данных</h3>
                    <p class="mb-0 fs-6">
                        Шифрование пароля, защищенные запросы и полная конфиденциальность
                        данных.
                    </p>
                </div>
            </div>
            <div class="col p-4">
                <div class="p-4 bg-light rounded-3">
                    <h3 class="mb-3">👭 Поиск друзей</h3>
                    <p class="mb-0 fs-6">
                        Найдите себе людей по вкусу: подпишитесь на человека, следите
                        за его новостями.
                    </p>
                </div>
            </div>
            <div class="col p-4">
                <div class="p-4 bg-light rounded-3">
                    <h3 class="mb-3">💫 Все для Вас</h3>
                    <p class="mb-0 fs-6">
                        Ваша лента с новостями, без рекламы. Только полезные рекомендации.
                    </p>
                </div>
            </div>
        </div>
        <h1>Аквариум</h1>
        <p>
            Аквариум - социальная сеть, доступная для всех. Полный доступ к регистрации,
            поиск друзей и собеседников по интересам.
        </p>

    </main>

    <?php include_once "../app/php/content/footer.php"; ?>
</body>

</html>
