<?php include_once "../../app/php/head.php"; ?>

<!-- PHP. Author: Daniil Dybka, daniil@dybka.ru -->
<title>Авторизация OAuth | Аквариум</title>

<link rel="stylesheet" href="/app/css/pages/about.css" />

<body class="container">
    <?php include_once "../../app/php/header.php"; ?>
    <main class="col-md-8 mx-auto" style="margin-bottom: 50px" id="main">
        <h1 class="h3">Разработка платформы Аквариум</h1>
        <p>
            Разработка социальной сети "Аквариум" отражает захватывающий и креативный процесс, способствующий созданию привлекательной
            онлайн-платформы. Это веб-приложение, построенное на PHP, объединяет в себе искусство интерфейса, инновационные функции
            и привлекательные возможности для общения, обмена информацией и нахождения сообществ с общими интересами.
        </p>

        <ul id="main-headers"></ul>

        <h2 class="h4">Дизайн и пользовательский опыт</h2>

        <p>
            Во время разработки "Аквариума" огромное внимание уделялось дизайну и удобству использования. Команда разработчиков
            работала над созданием привлекательного интерфейса, который не только эстетически приятен, но и функционален, делая
            использование социальной сети интуитивно понятным и увлекательным для каждого пользователя. Это включало в себя
            разработку привлекательных макетов страниц, удобной навигации и интуитивно понятных элементов управления.
        </p>

        <h2 class="h4">Интеграция регистрации через Яндекс и Google</h2>

        <p>
            Одним из ключевых моментов разработки было внедрение возможности регистрации через популярные онлайн-сервисы, такие как Яндекс и
            Google. Это дополнительный уровень удобства для пользователей, позволяющий им быстро и без лишних усилий присоединиться к "Аквариуму",
            используя свои существующие учетные записи. Такая интеграция способствует расширению аудитории и улучшению пользовательского опыта.
        </p>

        <h2 class="h4">Привлечение новых пользователей</h2>

        <p>
            Команда "Аквариума" активно работала над привлечением новых пользователей, используя различные стратегии, включая рекламные кампании,
            партнерские программы и социальные медиа. Приглашение новых людей в "Аквариум" создает динамичное и разнообразное сообщество,
            увеличивая активность и ценность платформы для всех ее участников.
        </p>

        <p>
            В результате этих усилий и преодоления различных технических и творческих вызовов, социальная сеть "Аквариум" стала не только
            интересным и привлекательным пространством для общения, но и символом внимания к деталям и стремлением создать уникальный и
            эффективный пользовательский опыт.
        </p>

        <h2 class="h4">Автор</h2>

        <p>
            Автор разработки:
            <a href="//ddybka.t.me" class="link">Даниил Дыбка</a>.
        </p>

        <h2 class="h4">Выражаем благодарность</h2>

        <ul>
            <li>
                <a href="//renkort.t.me" class="link">Роману Казину</a>
                за новые обложки и аватарки.
            </li>
            <!-- <li>
                <a href="//renkort.t.me" class="link">Анастасии Пара</a>
                за стикеры телеграм, изображения на главной странице и достижения.
            </li> -->
        </ul>

    </main>

    <div class="about-up about-up-dontsee" id="about-up">
        <a href="#" aria-label="Перейти наверх">
            <svg>
                <use xlink:href="/app/img/icons/bootstrap.min.svg#chevron-up"></use>
            </svg>
        </a>
    </div>

    <script src="/app/js/pages/about-addlinkhead.js"></script>

    <script src="/app/js/pages/about-addupbutton.js"></script>

    <?php include_once "../../app/php/bottom/footer-content.php"; ?>

    <?php include_once "../../app/php/bottom/javascript.php"; ?>
</body>

</html>
