@extends('layouts.main.main')

@section('page.title', 'Цифровая доступность')

@push('css')
<link rel="stylesheet" type="text/css" href="{{ asset('css/faq/include.css') }}" />
@endpush

@section('main.content')
    <div class="row gx-3">
        <div class="col-3 p-3">
            <x-page.title-anchor />
        </div>
        <div class="col-7 p-3">
            <h1>
                {{ __('Цифровая доступность') }}
            </h1>
            <p class="fs-5">
                {{ __('Цифровая доступность — ключ к инклюзивному миру.') }}
            </p>
            <h2>{{ __('Актуальность') }}</h2>
            <p>
                {{ __('В современном мире цифровые технологии стали неотъемлемой частью нашей жизни. Интернет, веб-сайты, мобильные приложения и другие цифровые ресурсы обеспечивают доступ к информации, развлечениям, образованию и социальным связям.') }}
            </p>
            <p>
                {{ __('Однако для многих людей с ограниченными возможностями эти ресурсы могут быть недоступными. Цифровая доступность контента призвана решить эту проблему, обеспечивая равные возможности для всех.') }}
            </p>
            <h2>{{ __('Что такое цифровая доступность?') }}</h2>
            <p>
                {{ __('Цифровая доступность контента — это принцип, согласно которому цифровые ресурсы (веб-сайты, мобильные приложения, электронные документы и т.д.) должны быть доступны для людей с различными ограниченными возможностями, такими как нарушения зрения, слуха, моторики, когнитивные расстройства и другие.') }}
            </p>
            <h2>{{ __('Достижение цифровой доступности') }}</h2>
            <p>
                {{ __('Для обеспечения цифровой доступности контента используются различные технологии и методы. Вот некоторые из них:') }}
            </p>
            <ul>
                <li>
                    {!! __('<mark>Альтернативный текст</mark> для изображений и других невизуальных элементов, который может быть распознан программами чтения с экрана для людей с нарушениями зрения') !!}
                </li>
                <li>
                    {{ __('Субтитры и текстовые расшифровки для аудио- и видеоматериалов, которые помогают людям с нарушениями слуха') }}
                </li>
                <li>
                    {!! __('Возможность <mark>увеличения и изменения контраста</mark> для людей с ограниченным зрением') !!}
                </li>
                <li>
                    {{ __('Поддержка навигации с помощью клавиатуры для людей с ограниченной моторикой') }}
                </li>
                <li>
                    {!! __('<mark>Простой и понятный интерфейс</mark> для людей с когнитивными расстройствами.') !!}
                </li>
            </ul>
            <h2>{{ __('Для чего нужна цифровая доступность?') }}</h2>
            <p>
                {{ __('Цифровая доступность контента — это не просто требование законодательства или стандартов, но и этическая необходимость, обеспечивающая равные возможности для всех людей. Создавая доступные цифровые ресурсы, мы способствуем построению более инклюзивного и справедливого общества, в котором каждый человек имеет доступ к информации, образованию, развлечениям и социальным связям независимо от своих ограниченных возможностей.') }}
            </p>

        </div>
    </div>

    <x-button-top />
@endsection

@push('js')
    <script src="{{ asset('js/page/left-bar-anchors.js') }}"></script>
@endpush
