@extends('layouts.main.main')

@section('page.title', __('API'))

@push('css')
<link rel="stylesheet" type="text/css" href="{{ asset('css/faq/include.css') }}" />
@endpush

@section('main.content')
    <div class="row gx-3">
        <div class="col-3 p-3">
            <x-page.title-anchor />
        </div>
        <div class="col-7 p-3">
            <h1>{{ __('API') }}</h1>
            <p class="fs-5">
                {{ __('Интерфейс API – универсальное средство взаимодействия с социальной сетью Аквариум.') }}
            </p>
            <h2>
                {{ __('Введение') }}
            </h2>
            <p>
                {{ __('Интерфейс API (Application Programming Interface) – это набор функций, методов, протоколов и инструментов, предоставляемых социальной сетью Аквариум, который позволяет разработчикам создавать свои приложения, взаимодействовать с данными и функциональностью Аквариума, расширять возможности социальной сети и интегрировать ее с другими приложениями и сервисами.') }}
            </p>
            <h2>
                {{ __('Зачем нужен интерфейс API?') }}
            </h2>
            <p>
                {{ __('Интерфейс API предоставляет разработчикам возможность использовать функциональные возможности Аквариума в своих приложениях и сервисах. Он позволяет получать доступ к профилям пользователей, публикациям, друзьям, сообщениям и другим данным, а также выполнять различные действия, такие как создание и редактирование записей, управление контактами, отправка уведомлений и т.д. Используя интерфейс API, разработчики могут создавать приложения, интегрированные с Аквариумом, расширяя возможности социальной сети и обеспечивая более гибкое и персонализированное взаимодействие для пользователей.') }}
            </p>
            <h2>
                {{ __('Как используется интерфейс API?') }}
            </h2>
            <h3>
                {{ __('Регистрация и получение доступа к API') }}
            </h3>
            <p>
                {{ __('Перед использованием интерфейса API Аквариума разработчику необходимо зарегистрировать свое приложение и получить API-ключ или токен доступа. Это обеспечит безопасность и контроль доступа к данным пользователей.') }}
            </p>
            <h3>
                {{ __('Аутентификация и авторизация') }}
            </h3>
            <p>
                {{ __('После получения API-ключа или токена доступа, разработчик должен использовать его для аутентификации и авторизации своего приложения. Таким образом, приложение может получить доступ к определенным данным и функциям социальной сети в соответствии с разрешениями пользователя.') }}
            </p>
            <h3>
                {{ __('Запросы к API и обработка данных') }}
            </h3>
            <p>
                {{ __('Разработчик может отправлять запросы к интерфейсу API Аквариума, используя различные методы передачи данных, такие как HTTP-запросы (например, GET, POST, PUT, DELETE). Запросы могут быть отправлены для получения данных о пользователях, их друзьях, записях, сообщениях и т.д., а также для выполнения определенных действий, таких как создание, обновление или удаление данных.') }}
            </p>
            <h3>
                {{ __('Обработка ответов API') }}
            </h3>
            <p>
                {{ __('Полученные ответы от интерфейса API Аквариума могут быть представлены в различных форматах данных, таких как JSON или XML. Разработчик должен обработать эти данные в своем приложении, чтобы извлечь необходимую информацию и выполнить дальнейшие операции.') }}
            </p>
            <h2>
                {{ __('Контроль и обновление данных') }}
            </h2>
            <p>
                {{ __('Интерфейс API предоставляет возможности добавления, обновления и удаления данных в Аквариуме. Разработчики могут создавать и редактировать записи пользователей, добавлять медиа-файлы, управлять друзьями и многим другим.') }}
            </p>
            <h2>
                {{ __('Схема запросов') }}
            </h2>
            <h3>
                {{ __('Получение данных о пользователях') }}
            </h3>
            <p>
                {{ __('Для получения данных о пользователях следует выполнить следующие запросы:') }}
            </p>
            <ul>
                <li>
                    {{ env('APP_URL') }}/api/users – все пользователи
                </li>
                <li>
                    {{ env('APP_URL') }}/api/user/id/{id} – пользователь по ID
                </li>
                <li>
                    {{ env('APP_URL') }}/api/user/{nickname} – пользователь по имени пользователя
                </li>
            </ul>
            <p>
                {{ __('При ошибке в запросе или отсутствии пользователя, ответом будет пустой JSON-объект. Получить информацию можно только о пользователе с подтвержденным аккаунтом') }}
            </p>
            <h4>
                {{ __('Схема данных, получаемых о пользователях') }}
            </h4>
            <ul>
                <li>
                    id – {{ __('номер пользователя') }} :: integer
                </li>
                <li>
                    username – {{ __('имя пользователя') }} :: string
                </li>
                <li>
                    firstName – {{ __('имя (псевдоним)') }} :: string
                </li>
                <li>
                    lastName – {{ __('фамилия (псевдоним)') }} :: string
                </li>
                <li>
                    avatar – {{ __('аватар') }} :: string
                </li>
                <li>
                    cap – {{ __('шапка') }} :: string
                </li>
                <li>
                    desc – {{ __('описание') }} :: string
                </li>
                <li>
                    sub – {{ __('количество подписок') }} :: integer
                </li>
                <li>
                    subs – {{ __('количество подписчиков') }} :: integer
                </li>
                <li>
                    achivs – {{ __('количество достижений') }} :: integer
                </li>
            </ul>
            <h3>
                {{ __('Получение данных о записях') }}
            </h3>
            <p>
                {{ __('Запросы для получения записей: ') }}
            </p>
            <ul>
                <li>
                    {{ env('APP_URL') }}/api/posts – {{ __('все записи') }}
                </li>
                <li>
                    {{ env('APP_URL') }}/api/posts/{id} – {{ __('все записи пользователя по его ID') }}
                </li>
                <li>
                    {{ env('APP_URL') }}/api/post/{id}/{idPost} – {{ __('запись с IDPOST у пользователя с его ID') }}
                </li>
            </ul>
            <h4>
                {{ __('Схема данных, получаемых о записях') }}
            </h4>
            <ul>
                <li>
                    idPost – {{ __('номер поста у пользователя') }} :: integer
                </li>
                <li>
                    idUser – {{ __('номер пользователя') }} :: integer
                </li>
                <li>
                    haveimage – {{ __('есть ли изображение у поста') }} :: boolean
                </li>
                <li>
                    imagename – {{ __('имя изображения') }} :: string
                </li>
                <li>
                    message – {{ __('сообщение поста') }} :: text
                </li>
                <li>
                    desc – {{ __('описание (открывок от сообщения без форматирования)') }} :: string
                </li>
            </ul>

        </div>
    </div>

    <x-button-top />
@endsection

@push('js')
    <script src="{{ asset('js/page/left-bar-anchors.js') }}"></script>
@endpush
